SIMISA@@@@@@@@@@JINX0D0t______

Wagon ( 68131-Y6

Comment( British Rail Y6 Tramway Engine )

Type ( Engine )
WagonShape ( MCLW_Y6_68131.s )
Size  ( 2.4m 3.2m 6.1m )
Mass ( 21.25t-uk )

Comment( ********* Coupler Information ****************             Included in this section - Type, Spring, Velocity, etc )

	Coupling (
         Type ( Chain )
              	Spring (
			Break ( 600kN 1000kN )
               	r0 ( 0cm 0cm )
              )
          CouplingHasRigidConnection (1)
     )  

Comment( ********** Brakes, Type, Force, etc ***************        Included in this section - Type, Force, Reservoir, Applicatiion, Release. etc )

BrakeSystemType ( "Vacuum_single_pipe" )
MaxBrakeForce ( 58kN ) Comment(55% MT Weight*Cof 0.5)
MaxHandbrakeForce ( 21kN ) Comment(20% MTW*0.5)
BrakeCylinderPressureForMaxBrakeBrakeForce ( 21inHg ) 

Comment (* Cast Iron Brakeshoes *)
ORTSBrakeShoeFriction ( 0.0 0.50 8.0 0.288 16.1 0.241 24.1 0.211 32.2 0.187 40.2 0.173 48.3 0.161 56.3 0.150 64.4 0.142 72.2 0.139 80.5 0.134 88.5 0.129 96.6 0.125 104.6 0.123 112.7 0.121)

Comment( ******* Curve Resistance & SuperElevation *********                  Included in this section - Wheelbase, gauge, etc )

CentreOfGravity ( 0m 1.5m 0m )
ORTSTrackGauge ( 4ft 8.5in )
ORTSUnbalancedSuperelevation ( 6in )
ORTSRigidWheelbase ( 6.5ft  )

Comment( ***************** Friction*************************                   Included in this section - Friction, Bearing Type )

ORTSBearingType ( Friction )
Comment(CN 1990 DW x18)
ORTSDavis_A ( 1841 )
ORTSDavis_B ( 5.79 )
ORTSDavis_C ( 2.938 )

ORTSWagonFrontalArea (55ft^2)
ORTSDavisDragConstant (0.0024)

Comments(  ******* Lights Section *******  Included in this section - Type, Colour, Location, Size, Control, etc)

	Lights	( 11
		Light	(
			comment( Flickering Firedoor )
			Type		( 0 )
			Conditions	(
				Headlight ( 0 )
				Unit ( 0 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff7200 )
					Position ( 0 1.3 -1.76 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 1.3 -1.76 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 1.4 )
					)
				)
			)
		Light	(
			comment( Front Lower Lamp White )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Front Middle Lamp White )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Front Lower Lamp Red )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff0000 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ee0000 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Front Middle Lamp Red )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 4 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff0000 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ee0000 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Rear Lower Lamp Red )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff0000 )
					Position ( 1.095 2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ee0000 )
					Position ( 1.095 2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Rear Middle Lamp Red )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 3 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ff0000 )
					Position ( 0 2.65 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ee0000 )
					Position ( 0 2.65 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Rear Lower Lamp White )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( 1.095 2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 1.095 2 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Rear Middle Lamp White )
			Type		( 0 )
			Conditions	(
				Headlight ( 4 )
				Unit ( 5 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( 0 2.65 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.65 -2.75 )
					Azimuth ( -180 -180 -180 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)

comment(***********************AI Lights***********************)
	
		Light	(
			comment( Front Lower AI Lamp White )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( -1.095 2.0 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		Light	(
			comment( Front Middle AI Lamp White )
			Type		( 0 )
			Conditions	(
				Control ( 1 )
				Service ( 2 )
				Unit ( 2 )
				)
			FadeIn	( 0.5 )
			FadeOut	( 0.5 )
			Cycle	( 0 )
			States	(	2
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffff70 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 -5.0 5.0 )
					Transition ( 0 )
					Radius ( 0.35 )
					)
				State	(
					Duration ( 0.05 )
					LightColour ( 80ffe610 )
					Position ( 0 2.65 2.75 )
					Azimuth ( 0.0 0.0 0.0 )
					Transition ( 0 )
					Radius ( 0.3 )
					)
				)
			)
		) 
    


Comment( ******* Miscellaneous Wagon Information************                 Included in this section - Passenger View, Sounds, Freight Animations Intake Points for Tank Engine )

	FreightAnim ( "..\\common.crew\\LIB_1\\Y6.s" 0 3.0 0.0 )

Comment ( ==Passenger View== )
	Inside (
        PassengerCabinFile ( MCLW_Y6_68131.s )
        PassengerCabinHeadPos ( 1.455 2.95 2.5 )
        RotationLimit ( 90 180 160 )
        StartDirection ( 0 0 0 )
  	)

	IntakePoint ( 0.9 10 FuelWater )
	IntakePoint ( -0.9 8 FuelCoal )
    
Sound ( "..\\..\\common.MEP\\2CylinderSound\\2c-100a-eng01.sms" )
)



Engine ( 68131-Y6
    
Effects
	(
		SteamSpecialEffects
		(
			comment
			(
				the format of these little blocks is as follow:

				offset.x offset.y offset.z
				normal.x normal.y normal.z
				width in metres

				defining the offset from the shape pivot point
				where steam / smoke should appear, the direction
				it should go and the width of the nozzle
			)

			WhistleFX
			(
				0.0 3.0 -0.75
				0 1 0.5
				0.045
			)

			StackFX
			(
				0 3.5 1.204
				0 1.25 0
				0.28
			)

			Injectors2FX
			(
				1.22 0.5 -2.6
				0 -1 -1
				0.15
			)
			Injectors1FX
			(
				1.22 0.5 -2.6
				0 -1 -1
				0.15
			)

			CylindersFX
			(
				-0.8 0.8 2.5
				0 0 2
				0.2
			)

			CylindersFX
			(
				0.8 0.8 2.5
				0 0 2
				0.2
			)
		)
	)

Wagon ( 68131-Y6 )
Comment ( *************General Information******************                    Included in this section - Wheels, sanding, etc )

ORTSSteamLocomotiveType ( Simple )
Type ( Steam )
WheelRadius ( 18.5in )
NumWheels ( 2 )
ORTSDriveWheelWeight ( 21.25t-uk  )  
Sanding ( 25mph )

Comment ( ****************** Boiler ************************          Included in this section - Length, volume, heating area, pressure, etc )

ORTSSteamBoilerType ( Saturated )
BoilerVolume ( 46ft^3 ) 
ORTSEvaporationArea ( 350ft^2 )
MaxBoilerPressure ( 140psi )

Comment ( ***************** Cylinders **********************         Included in this section - Number, Stroke, Diameter, steam usage, etc )

NumCylinders ( 2 )
CylinderStroke ( 15in ) 
CylinderDiameter ( 11in ) 
ORTSCylinderEfficiencyRate ( 1.0 )  Comment ( Default Setting)

Comment ( ******************* Fire *************************          Included in this section - Fuel Quality, Grate Area, Shoveling Rate, etc ) 

ORTSFuelCalorific ( 12390btu/lb ) Comment(Blidworth Coal)
ORTSGrateArea ( 7ft^2 )
SteamFiremanMaxPossibleFiringRate( 3000 ) 
ShovelCoalMass ( 14lb )    

Comment ( ******************* Fuel *************************
Included in this section - Coal, water, Tender Presence, etc )

MaxTenderCoalMass ( 0.5t-uk )
MaxTenderWaterMass ( 5000lb )
IsTenderRequired( 0 )	

Comment(       ********ADVANCED PARAMETERS**********      )
Comment( Remove comment statement and outer brackets as required)

Comment(ORTSBoilerEvaporationRate ( 16.0 ))

ORTSMaxIndicatedHorsepower ( 300.0hp ) Comment(Calculated from CTN)

ORTSCylinderPortOpening ( 0.085 )Comment(0.05 to 0.12)

Comment(ORTSBoilerEfficiency( 0.0 0.905  190.0 0.4525 )) Comment(From 4MT Report)

Comment(ORTSBurnRate( 0.0 10.0  7875.0 1000.0  12337.0 2000.0  14875.0 2500.0  16275.0 3000.0  18375.0 3500.0 )) 

Comment(ORTSCylinderInitialPressureDrop ( 0.0 0.99 350 0.98 ))

Comment(ORTSCylinderBackPressure ( 0.0 0.0  3000 12.0  ))

Comment ( ***********Gearing (If used) *************************
Included in this section - Gear type, ratio, etc )

Comment ( *****************Brake System ********************        Included in this section - Compressor, Reservoir, Application rates, etc )   

TrainBrakesControllerMinSystemPressure( 0 )
TrainBrakesControllerMaxSystemPressure( 21inHg )
BrakeEquipmentType ( "Vacuum_brake, Handbrake " )
BrakeSystemType ( "Vacuum_single_pipe" )

Comment(************Train Control System (if used)**********        
Includes Monitoring of Overspeed, Vigilance, Emergency Braking)

Comment ( ************** Engine Controls ******************** 
Included-Controllers for Regulator, Reverser, Brakes etc) 

EngineControllers (
Regulator ( 0 1 0.0475 0 
            NumNotches( 0 )
    			)
Cutoff    ( -0.75 0.75 0.01 0 
            NumNotches( 0 )		
  		)

Brake_Train ( 0 1 0.1 0.1
NumNotches( 1
Notch( 0 1 TrainBrakesControllerVacuumContinuousServiceStart )
)) 


            Brake_Hand ( 0 1 0.0125 0
                NumNotches ( 0 )
            )
            FireDoor ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Sanding( 0 1 0 )
            Blower ( 0 1 0.025 0.2
                NumNotches ( 0 )
            )
            HeatingTap ( 0 1 0.025 0
                NumNotches ( 0 )
            )
            Shovel ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            DampersFront ( 0 1 0.1 1
                NumNotches ( 0 )
            )
            DampersBack ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector1Steam ( 0 1 0 )
            Injector2Steam ( 0 1 0 )
            Injector1Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            Injector2Water ( 0 1 0.1 0
                NumNotches ( 0 )
            )
            CylinderCocks ( 0 1 1 )
            Whistle ( 0 1 0 )
            WaterScoop ( 0 1 0 )
            SmallEjectorOrCompressor( 0 1 1 )
            Headlights( 0 1 0 )
        )

Comment ( ********** Miscellaneous Information *************              Included in this section - Alternate Views, Sounds, Names, Description etc )  

Cabview ( y6.cvf )
HeadOut ( -1.3 2.95 2.5 )
 
Sound ( "..\\..\\common.MEP\\2CylinderSound\\2c-100a-cab01.sms" )
   	Name ( "68131 Y6 Wisbech & Upwell Tramway" )
 	Description (
"These 0-4-0 trams were a common site, performing light shunting duties, often around dock yards.  None have survived into preservation.\n"+
	"Model copyright(c) Chris Heighton (morpethcurve)\n"+
	"Version 2.0\n"
)
)
